<?php
$regEmail = '/^([a-zA-Z0-9\-\_.ôîûêéèçà\']+)(\@){1}((hotmail)|(outlook)|(laposte)|(free)|(orange)|(gmail)){1}.((fr)|(com)|(net)){1}$/';
$regPseudo = '/^[A-Za-z0-9\-\_.ôîûêéèçà\']+$/';
$regName = '/^[A-Z]?[a-zçôîûêéèçà\-\']+$/';
$regMail = '/^[a-zA-Z0-9\.ôîûêéèçà\- \_]+[@]{1}((hotmail)|(laposte)|(free)|(orange)|(outlook)|(yahoo)){1}(.){1}((fr)|(com)|(net)){1}$/';
$regPhone = '/^(06|07){1}[0-9]{8}$/';
$regBirth = '/^(([0]{1}[1-9]{1})|([1-2]{1}[0-9]{1})|([3]{1}[0-2]{1}))|\/(([0]{1}[1-9]{1})|([1]{1}[0-2]{1}))\/([1]{1}[9]{1}[\d]{1}[\d]{1})|([2]{1}[0]{1}[0|1]{1}[\d]{1})$/';
$regAddress = '/^[A-Za-z0-9\-\_.ôîûêéèçà\' ]+$/';
$regPass = '/^[A-Za-z0-9çôîûêéèçà\-\'#@&!%$*]+$/';
$regCity = '/^[0-9]+$/';
$regPostalCode = '/^[0-9]+$/';